// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

int[] NewArray(int size)
{
    int[] array = new int[size];
    for (int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(100, 1000);
    }
    return array;
}

void ShowArray(int[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]}, ");
    }
    Console.Write("\b\b]");

}

int EvenNumbers(int[] array)
{
    Console.WriteLine("");
    int sum = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            sum += 1;
        }
    }
    return sum;
}

Console.Write("Задайте размер массива: ");
int size = Convert.ToInt32(Console.ReadLine());

int[] newArray = NewArray(size);
ShowArray(newArray);

Console.WriteLine($"Количество чётных чисел в массиве: {EvenNumbers(newArray)}.");